import pandas as pd

# 创建数据
data = {
    "模型": ["YOLO v3", "YOLO v5", "改进模型1", "改进模型2"],
    "总体精度": [0.703, 0.741, 0.71, 0.725],
    "不可回收": [0.715, 0.78, 0.765, 0.76],
    "厨余垃圾": [0.765, 0.808, 0.777, 0.808],
    "可回收玻璃": [0.683, 0.691, 0.661, 0.648],
    "可回收纺织": [0.829, 0.867, 0.834, 0.864],
    "可回收金属": [0.597, 0.597, 0.555, 0.569],
    "可回收木制": [0.609, 0.769, 0.672, 0.7],
    "可回收皮革": [0.855, 0.821, 0.824, 0.814],
    "可回收塑料": [0.637, 0.664, 0.634, 0.652],
    "可回收陶瓷": [0.696, 0.753, 0.714, 0.745],
    "可回收纸张": [0.643, 0.663, 0.66, 0.688]
}

# 创建DataFrame
df = pd.DataFrame(data)

# 将数据写入Excel文件
file_path = "模型数据.xlsx"
df.to_excel(file_path, index=False)

print("数据已成功写入 Excel 文件:", file_path)